## Merge

Merges two or more dataframes based on one or more common columns.
Can be used to combine data based on inner, outer, left, or right joins.
Can handle non-matching values in the columns being merged.
Can handle multiple columns being merged at once.
The resulting dataframe may have new columns and rows depending on how the merge is performed.

In [4]:
# # Syntax
# # 1) Same column name
# pd.merge(left_df, right_df, on=[common column name in both df], how='inner',suffixes=('_df3', '_df4')) # default how=inner   #'left'
#                                                                                                                              # 'right'
#                                                                                                                              # 'outer'
#                                                                                                                              # 'left'
#                                                                                                                              # 'cross'

# # 2) Different column name
# pd.merge(left_df, right_df, left_on=[columns from left df],right_on=[columns from right df], how='inner',suffixes=('_df3', '_df4')) # default how=inner   #'left'
#                                                                                                                                                          # 'right'
#                                                                                                                                                          # 'outer'
#                                                                                                                                                          # 'left'
#                                                                                                                                                          # 'cross'

In [5]:
import pandas as pd

In [7]:
cat=pd.read_excel(r"D:\Minskole classes\dataAnalysis\Pandas\Merge Input data.xlsx",sheet_name="Catalog")
Eng=pd.read_excel(r"D:\Minskole classes\dataAnalysis\Pandas\Merge Input data.xlsx",sheet_name="Eng")
Phy=pd.read_excel(r"D:\Minskole classes\dataAnalysis\Pandas\Merge Input data.xlsx",sheet_name="Phy")
Chem=pd.read_excel(r"D:\Minskole classes\dataAnalysis\Pandas\Merge Input data.xlsx",sheet_name="Chem")
Math=pd.read_excel(r"D:\Minskole classes\dataAnalysis\Pandas\Merge Input data.xlsx",sheet_name="Math")

In [8]:
cat

    Roll No First Name    Last Name
0         1      Aarav        Patil
1         2      Aarvi     Bhandari
2         3      Aditi       Rajput
3         4     Aditya        Pawar
4         5      Anaya      Gawande
5         6      Arjun         More
6         7      Arnav      Khedkar
7         8      Ayaan       Jadhav
8         9      Disha       Chavan
9        10       Isha       Kamble
10       11       Jaya       Bhagat
11       12        Jay       Bhagat
12       13      Kaira        Nikam
13       14      Krish      Bhosale
14       15      Kunal   Kshirsagar
15       16     Nikhil     Patankar
16       17      Payal        Patil
17       18      Pooja       Mhatre
18       19    Radhika     Ghorpade
19       20     Raghav     Khedekar
20       21      Rahul        Kadam
21       22    Reyansh        Joshi
22       23    Rishabh       Ghadge
23       24       Riya     Kulkarni
24       25      Rohan  Suryavanshi
25       26    Samarth       Shinde
26       27     Shreya     Dandekar
27       28      Sneha      Gokhale
28       29      Tanvi       Ingale
29       30      Tarun       Dhumal
30       31      Tejas     Waghmare
31       32     Vihaan     Deshmukh
32       33     Vivaan         Nair

In [9]:
Eng

    Roll No  English
0         4       92
1        11       92
2        23       92
3        24       91
4         2       90
5         3       90
6         8       90
7        12       90
8        17       89
9        27       89
10       13       88
11       28       88
12       32       88
13       16       87
14       33       87
15        9       86
16        1       85
17        7       85
18       31       85
19        5       84
20       18       84
21       19       83
22       22       82
23       30       82
24       15       81
25       21       81
26       14       80
27       10       79
28       20       79
29       25       78
30       29       78
31        6       76
32       26       43

In [10]:
Phy

   First Name    Last Name  Physics
0       Anaya      Gawande        90
1       Arnav      Khedkar        90
2       Arjun         More        89
3       Aditi       Rajput        88
4      Aditya        Pawar        88
5        Jaya       Bhagat        88
6       Tarun       Dhumal        87
7       Krish      Bhosale        85
8        Riya     Kulkarni        84
9       Sneha      Gokhale        84
10      Disha       Chavan        83
11      Rahul        Kadam        83
12     Vivaan         Nair        83
13      Rohan  Suryavanshi        82
14      Tejas     Waghmare        82
15      Aarvi     Bhandari        81
16      Kunal   Kshirsagar        81
17     Vihaan     Deshmukh        81
18      Kaira        Nikam        80
19     Nikhil     Patankar        80
20    Reyansh        Joshi        80
21      Pooja       Mhatre        79
22    Radhika     Ghorpade        79
23    Samarth       Shinde        79
24      Aarav        Patil        78
25    Rishabh       Ghadge        78
26        Jay       Bhagat        77
27      Tanvi       Ingale        77
28       Isha       Kamble        76
29      Payal        Patil        76
30      Ayaan       Jadhav        75
31     Shreya     Dandekar        75
32     Raghav     Khedekar        49

In [11]:
Chem

      FName        LName   Chemistry
0     Arjun         More           91
1   Radhika     Ghorpade           91
2     Aarav        Patil           90
3     Rohan  Suryavanshi           90
4     Sneha      Gokhale           90
5     Tejas     Waghmare           90
6      Isha       Kamble           89
7    Nikhil     Patankar           89
8     Ayaan       Jadhav           88
9     Pooja       Mhatre           88
10   Shreya     Dandekar           88
11    Payal        Patil           87
12  Samarth       Shinde           87
13  Rishabh       Ghadge           86
14    Aarvi     Bhandari           85
15    Kunal   Kshirsagar           85
16   Vihaan     Deshmukh           85
17    Kaira        Nikam           84
18    Rahul        Kadam           84
19  Reyansh        Joshi           84
20    Krish      Bhosale           83
21    Tanvi       Ingale           83
22    Aditi       Rajput           82
23    Anaya      Gawande           82
24   Raghav     Khedekar           82
25    Disha       Chavan           80
26   Vivaan         Nair           79
27    Arnav      Khedkar           78
28     Riya     Kulkarni           78
29   Aditya        Pawar           76
30     Jaya       Bhagat           76
31      Jay       Bhagat           65
32    Tarun       Dhumal           44

In [12]:
Math

   Roll No First Name Last Name  Mathematics
0        1      Aarav     Patil           92
1       10       Isha    Kamble           92
2       13      Kaira     Nikam           90
3       20     Raghav  Khedekar           90
4       21      Rahul     Kadam           90
5        9      Disha    Chavan           89
6       11       Jaya    Bhagat           89
7       12        Jay    Bhagat           88
8        8      Ayaan    Jadhav           84
9        7      Arnav   Khedkar           46

In [13]:
print("Catalog", len(cat))
print("Eng", len(Eng))
print("Phy", len(Phy))
print("Chem", len(Chem))
print("Math", len(Math))

Catalog 33
Eng 33
Phy 33
Chem 33
Math 10

In [14]:
cat.head(5)

   Roll No First Name Last Name
0        1      Aarav     Patil
1        2      Aarvi  Bhandari
2        3      Aditi    Rajput
3        4     Aditya     Pawar
4        5      Anaya   Gawande

In [15]:
Eng.head(5)

   Roll No  English
0        4       92
1       11       92
2       23       92
3       24       91
4        2       90

In [17]:
data=pd.merge(cat,Eng , on="Roll No", how="left")
data.head(5)

   Roll No First Name Last Name  English
0        1      Aarav     Patil       85
1        2      Aarvi  Bhandari       90
2        3      Aditi    Rajput       90
3        4     Aditya     Pawar       92
4        5      Anaya   Gawande       84

In [18]:
Phy.head(5)

  First Name Last Name  Physics
0      Anaya   Gawande        90
1      Arnav   Khedkar        90
2      Arjun      More        89
3      Aditi    Rajput        88
4     Aditya     Pawar        88

In [19]:
data2=pd.merge(data,Phy , on=["First Name","Last Name"],how="left")
data2.head(5)

   Roll No First Name Last Name  English  Physics
0        1      Aarav     Patil       85        78
1        2      Aarvi  Bhandari       90        81
2        3      Aditi    Rajput       90        88
3        4     Aditya     Pawar       92        88
4        5      Anaya   Gawande       84        90

In [20]:
Chem.head(5)

     FName        LName   Chemistry
0    Arjun         More           91
1  Radhika     Ghorpade           91
2    Aarav        Patil           90
3    Rohan  Suryavanshi           90
4    Sneha      Gokhale           90

In [21]:
data3=pd.merge(data2,Chem , left_on= ["First Name","Last Name"],right_on=["FName","LName"],how="left")
data3.head(5)

,Roll No,First Name,Last Name,English,Physics,FName,LName,Chemistry
0,1,Aarav,Patil,85,78,Aarav,Patil,90
1,2,Aarvi,Bhandari,90,81,Aarvi,Bhandari,85
2,3,Aditi,Rajput,90,88,Aditi,Rajput,82
3,4,Aditya,Pawar,92,88,Aditya,Pawar,76
4,5,Anaya,Gawande,84,90,Anaya,Gawande,82

In [24]:
data4=pd.merge(data3,Math,on=["First Name","Last Name"],how="left")
data4.head(5)

,Roll No_x,First Name,Last Name,English,Physics,FName,LName,Chemistry,Roll No_y,Mathematics
0,1,Aarav,Patil,85,78,Aarav,Patil,90,1.0,92.0
1,2,Aarvi,Bhandari,90,81,Aarvi,Bhandari,85,NaN,NaN
2,3,Aditi,Rajput,90,88,Aditi,Rajput,82,NaN,NaN
3,4,Aditya,Pawar,92,88,Aditya,Pawar,76,NaN,NaN
4,5,Anaya,Gawande,84,90,Anaya,Gawande,82,NaN,NaN

In [25]:
data5=pd.merge(data3,Math,on=["First Name","Last Name"],how="left",suffixes=("_data3","_math"))
data5.head(5)

,Roll No_data3,First Name,Last Name,English,Physics,FName,LName,Chemistry,Roll No_math,Mathematics
0,1,Aarav,Patil,85,78,Aarav,Patil,90,1.0,92.0
1,2,Aarvi,Bhandari,90,81,Aarvi,Bhandari,85,NaN,NaN
2,3,Aditi,Rajput,90,88,Aditi,Rajput,82,NaN,NaN
3,4,Aditya,Pawar,92,88,Aditya,Pawar,76,NaN,NaN
4,5,Anaya,Gawande,84,90,Anaya,Gawande,82,NaN,NaN

In [26]:
data5=pd.merge(data3,Math,on=["First Name","Last Name"],how="right",suffixes=("_data3","_math"))
data5.head(5)

,Roll No_data3,First Name,Last Name,English,Physics,FName,LName,Chemistry,Roll No_math,Mathematics
0,1,Aarav,Patil,85,78,Aarav,Patil,90,1,92
1,10,Isha,Kamble,79,76,Isha,Kamble,89,10,92
2,13,Kaira,Nikam,88,80,Kaira,Nikam,84,13,90
3,20,Raghav,Khedekar,79,49,Raghav,Khedekar,82,20,90
4,21,Rahul,Kadam,81,83,Rahul,Kadam,84,21,90

In [28]:
data5=pd.merge(data3,Math,on=["First Name","Last Name"],how="inner",suffixes=("_data3","_math"))
data5

,Roll No_data3,First Name,Last Name,English,Physics,FName,LName,Chemistry,Roll No_math,Mathematics
0,1,Aarav,Patil,85,78,Aarav,Patil,90,1,92
1,7,Arnav,Khedkar,85,90,Arnav,Khedkar,78,7,46
2,8,Ayaan,Jadhav,90,75,Ayaan,Jadhav,88,8,84
3,9,Disha,Chavan,86,83,Disha,Chavan,80,9,89
4,10,Isha,Kamble,79,76,Isha,Kamble,89,10,92
5,11,Jaya,Bhagat,92,88,Jaya,Bhagat,76,11,89
6,12,Jay,Bhagat,90,77,Jay,Bhagat,65,12,88
7,13,Kaira,Nikam,88,80,Kaira,Nikam,84,13,90
8,20,Raghav,Khedekar,79,49,Raghav,Khedekar,82,20,90
9,21,Rahul,Kadam,81,83,Rahul,Kadam,84,21,90